src/InformationRegisters/ИС_MP_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МодельРаботы</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_МП_ДанныеОтладки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МП_ДанныеОтладки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МетодыHTTP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовкиЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовкиОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ОстаткиFBO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ОстаткиFBO</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ДанныеВыгрузкиКИЗов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ДанныеВыгрузкиКИЗов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыгруженныхТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказМП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_АЛИ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИС_MP_Сервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РаботаСФормами

//+ ИнфоСофт Ивонин К.А. 06.07.22 УА #46999
Процедура ПриСозданииНаСервере(ЭтотОбъект) Экспорт
	ЭтотОбъект.Профиль = ИС_MP_СерверПовтИсп.ПолучитьПрофильПоУмолчанию();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.07.22 УА #46999

#КонецОбласти

#Область ОбщегоНазначения

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
Функция ПолучитьUnixTimeStamp(Дата) Экспорт 
	Возврат УниверсальноеВремя(Дата, ИС_MP_СерверПовтИсп.ЧасовойПоясИнформационнойБазы()) - '19700101'; 
КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
Функция ПолучитьДатуИзUnixTimeStamp(UnixTime) Экспорт 
	Возврат МестноеВремя('19700101' + UnixTime, ИС_MP_СерверПовтИсп.ЧасовойПоясИнформационнойБазы()); 
КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 24.01.23 УА #53535
Функция РазбитьМассивПоNЭлементов(Массив, N) Экспорт

	Результат = Новый Массив;
	
	Если Массив.Количество() < N Тогда
		Результат.Добавить(Массив);
		Возврат Результат;
	КонецЕсли;
	
	Счетчик = 1;
	ВременныйМассив = Новый Массив;
	
	Для Каждого Элемент Из Массив Цикл
	
		Если Счетчик = N Тогда
		
			Счетчик = 1;
			Результат.Добавить(ВременныйМассив);
			ВременныйМассив = Новый Массив;
			
		КонецЕсли;
		
		ВременныйМассив.Добавить(Элемент);
		
		Счетчик = Счетчик + 1;	
	
	КонецЦикла; 
	
	Если ВременныйМассив.Количество() > 0 Тогда
		Результат.Добавить(ВременныйМассив);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 24.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 15.12.21 УА #40085
Функция ПолучитьИмяКонфигурации() Экспорт
	Возврат ИС_MP_СерверПовтИсп.ПолучитьИмяКонфигурации();
КонецФункции //- ИнфоСофт Ивонин К.А. 15.12.21 УА #40085 

//+ ИнфоСофт Ивонин К.А. 31.03.22 УА #44037
Функция ПолучитьВерсиюКонфигурации() Экспорт
	Возврат ИС_MP_СерверПовтИсп.ПолучитьВерсиюКонфигурации();
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.22 УА #44037

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #70076
Функция ПолучитьВерсиюБезРедакции() Экспорт
	Возврат ИС_MP_СерверПовтИсп.ПолучитьВерсиюБезРедакции();	
КонецФункции //- ИнфоСофт Ивонин К.А. 13.02.24 УА #70076

//+ ИнфоСофт Ивонин К.А. 07.10.21 УА #38646
Процедура ОтсортироватьМассив(Массив, Направление = "Возр") Экспорт
	
	СписокСортировки = Новый СписокЗначений;
	СписокСортировки.ЗагрузитьЗначения(Массив);
	СписокСортировки.СортироватьПоЗначению(НаправлениеСортировки[Направление]);
	Массив = СписокСортировки.ВыгрузитьЗначения();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 07.07.22 УА #46999
//+ ИнфоСофт Тимофеева А.А. 04.04.2025 УА #79192
//Процедура ЗаписатьВЖРИСообщитьПользователю(Событие, Сообщение) Экспорт
Процедура ЗаписатьВЖРИСообщитьПользователю(Событие, Сообщение, УровеньЖР = Неопределено) Экспорт
	Если УровеньЖР = Неопределено Тогда
		УровеньЖР = УровеньЖурналаРегистрации.Ошибка; 	
	КонецЕсли;
	//- ИнфоСофт Тимофеева А.А. 04.04.2025 УА #79192
	ОбщегоНазначения.СообщитьПользователю(Сообщение);
	//+ ИнфоСофт Тимофеева А.А. 04.04.2025 УА #79192
	//ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , Сообщение);	
	ЗаписьЖурналаРегистрации(Событие, УровеньЖР, , , Сообщение);
	//- ИнфоСофт Тимофеева А.А. 04.04.2025 УА #79192	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.07.22 УА #46999

//+ ИнфоСофт Стояк Ю.К. 04.03.2023 УА #54628
Функция ПолучитьСтруктуруИзСоответствия(Структура) Экспорт
	
	СтруктураВозврат = Новый Структура;
	
	Если ТипЗнч(Структура) = Тип("Соответствие") Тогда
		
		ФлагОшибка=Ложь;
		
		Для Каждого Элемент Из Структура Цикл
			Попытка
				СтруктураВозврат.Вставить(Элемент.Ключ, ПолучитьСтруктуруИзСоответствия(Элемент.Значение));
			Исключение
				ФлагОшибка=Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
		
		Если ФлагОшибка Тогда  
			
			СтруктураВозврат = Новый Массив;
			
			Для Каждого Элемент Из Структура Цикл 
				
				ДопСтруктура = Новый Структура;
				ДопСтруктура.Вставить("Ключ",Элемент.Ключ);
				ДопСтруктура.Вставить("Значение", ПолучитьСтруктуруИзСоответствия(Элемент.Значение));
				СтруктураВозврат.Добавить(ДопСтруктура); 
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат СтруктураВозврат; 
		
	ИначеЕсли ТипЗнч(Структура)=Тип("Массив") Тогда
		
		НовыйМассив = Новый Массив;
		
		Для Каждого Элемент Из Структура Цикл
			НовыйМассив.Добавить(ПолучитьСтруктуруИзСоответствия(Элемент));
		КонецЦикла; 
		
		Возврат НовыйМассив;
		
	КонецЕсли;
	
	Возврат Структура;   
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.03.2023 УА #54628 

//+ ИнфоСофт Ивонин К.А. 13.04.23 УА #57127
// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ИС_MP_Сервер.Пауза", Параметры);
	КонецЕсли;
		
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 28.01.21 УА #30203
//
// Функция - Получить ссылку на перечисление
// Пытается получить ссылку на значение указанного перечисления по названию,
// при неудаче возвращает пустую ссылку
//
// Параметры:
//  Перечисление - ПеречислениеСсылка - Объект метаданных конфигурации перечисление 
//  Значение	 - Строка - Искомое перечисление 
// 
// Возвращаемое значение:
// СсылкаНаПеречисление - Возвращает ссылку на найденное по имени значение или пустую ссылку  
//
Функция ПолучитьПеречислениеПоЗначению(Перечисление, Значение) Экспорт

	Результат = Перечисление.ПустаяСсылка();
	
	Попытка
		Результат = Перечисление[Значение];
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 28.01.21 УА #30203

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
Функция ПолучитьТаблицуЗначенийИзExcel(Адрес, Параметры = Неопределено) Экспорт 
	
	Событие = ПолучитьИмяСобытия("ПолучитьТаблицуЗначенийИзExcel");
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(Адрес);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Имя);
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ЗаписатьВЖРИСообщитьПользователю(Событие, "Не удалось удалить временный файл" + Имя);
	КонецПопытки;
	
	ТабличныйДокумент.Область().Разъединить();
	
	ПерваяСтрока = 1;
	ПерваяКолонка = 1;	
	ПоследняяСтрока = ТабличныйДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабличныйДокумент.ШиринаТаблицы;
		
	Если ПоследняяСтрока = 0 Тогда	
		ОбщегоНазначения.СообщитьПользователю("Файл excel пуст");
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		
		Если Параметры.Свойство("ПерваяСтрока") И Параметры.ПерваяСтрока <> 0 Тогда
			ПерваяСтрока = Параметры.ПерваяСтрока;
		КонецЕсли;
		
		Если Параметры.Свойство("ПерваяКолонка") И Параметры.ПерваяКолонка <> 0 Тогда
			ПерваяКолонка = Параметры.ПерваяКолонка;
		КонецЕсли;
		
		Если Параметры.Свойство("ПоследняяСтрока") И Параметры.ПоследняяСтрока <> 0 Тогда
			ПоследняяСтрока = Параметры.ПоследняяСтрока;
		КонецЕсли;
		
		Если Параметры.Свойство("ПоследняяКолонка") И Параметры.ПоследняяКолонка <> 0 Тогда
			ПоследняяКолонка = Параметры.ПоследняяКолонка;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьЯчеек = ТабличныйДокумент.Область(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	Результат = ПостроительОтчета.Результат.Выгрузить();
	
	Возврат Результат;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828
Функция СтрокаВДату(Знач Значение) Экспорт 
	
	ПустаяДата = Дата(1, 1, 1);
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат ПустаяДата;
	КонецЕсли;
	
	ОписаниеДаты = Новый ОписаниеТипов("Дата");
	Дата = ОписаниеДаты.ПривестиЗначение(Значение);
	
	Если ТипЗнч(Дата) = Тип("Дата")
		И ЗначениеЗаполнено(Дата) Тогда 
		
		Возврат Дата;
	КонецЕсли;
	
	#Область ПодготовкаЧастейДаты
	
	КоличествоСимволов = СтрДлина(Значение);
	
	Если КоличествоСимволов > 25 Тогда 
		Возврат ПустаяДата;
	КонецЕсли;
	
	ЧастиЗначения = Новый Массив;
	ЧастьЗначения = "";
	
	Для НомерСимвола = 1 По КоличествоСимволов Цикл 
		
		Символ = Сред(Значение, НомерСимвола, 1);
		
		Если ЭтоЧисло(Символ) Тогда 
			
			ЧастьЗначения = ЧастьЗначения + Символ;
			
		Иначе
			
			Если Не ПустаяСтрока(ЧастьЗначения) Тогда 
				ЧастиЗначения.Добавить(ЧастьЗначения);
			КонецЕсли;
			
			ЧастьЗначения = "";
			
		КонецЕсли;
		
		Если НомерСимвола = КоличествоСимволов
			И Не ПустаяСтрока(ЧастьЗначения) Тогда 
			
			ЧастиЗначения.Добавить(ЧастьЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЧастиЗначения.Количество() < 3 Тогда 
		Возврат ПустаяДата;
	КонецЕсли;
	
	Если ЧастиЗначения.Количество() < 4 Тогда 
		ЧастиЗначения.Добавить("00");
	КонецЕсли;
	
	Если ЧастиЗначения.Количество() < 5 Тогда 
		ЧастиЗначения.Добавить("00");
	КонецЕсли;
	
	Если ЧастиЗначения.Количество() < 6 Тогда 
		ЧастиЗначения.Добавить("00");
	КонецЕсли;
	
	#КонецОбласти
	
	// Если формат ггггММддЧЧммсс:
	НормализованноеЗначение = ЧастиЗначения[2] + ЧастиЗначения[1] + ЧастиЗначения[0]
		+ ЧастиЗначения[3] + ЧастиЗначения[4] + ЧастиЗначения[5];
	
	Дата = ОписаниеДаты.ПривестиЗначение(НормализованноеЗначение);
	
	Если ТипЗнч(Дата) = Тип("Дата")
		И ЗначениеЗаполнено(Дата) Тогда 
		
		Возврат Дата;
	КонецЕсли;
	
	// Если формат ггггддММЧЧммсс
	НормализованноеЗначение = ЧастиЗначения[2] + ЧастиЗначения[0] + ЧастиЗначения[1]
		+ ЧастиЗначения[3] + ЧастиЗначения[4] + ЧастиЗначения[5];
	
	Дата = ОписаниеДаты.ПривестиЗначение(НормализованноеЗначение);
	
	Если ТипЗнч(Дата) = Тип("Дата")
		И ЗначениеЗаполнено(Дата) Тогда 
		
		Возврат Дата;
	КонецЕсли;
	
	Возврат ПустаяДата;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828

//+ ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828
Функция ЭтоЧисло(Знач ПроверяемоеЗначение) Экспорт 
	
	Если ПроверяемоеЗначение = "0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Возврат ОписаниеЧисла.ПривестиЗначение(ПроверяемоеЗначение) <> 0;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 02.07.2024 УА #78828

//+ ИнфоСофт Ивонин К.А. 04.07.24 УА #78901
Функция ПредставлениеОшибки(ИнформацияОбОшибке, Краткое = Ложь) Экспорт
		
	Если Краткое Тогда 
		Возврат ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	Иначе
		Возврат ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;

КонецФункции //- ИнфоСофт Ивонин К.А. 04.07.24 УА #78901

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьМаркетплейсы() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.ИС_МП_Маркетплейсы.ВБ);
	Результат.Добавить(Перечисления.ИС_МП_Маркетплейсы.Озон);
	Результат.Добавить(Перечисления.ИС_МП_Маркетплейсы.ЯМ);
	Результат.Добавить(Перечисления.ИС_МП_Маркетплейсы.Сбер);
	Результат.Добавить(Перечисления.ИС_МП_Маркетплейсы.Али);
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Результат.Добавить(Перечисления.ИС_МП_Маркетплейсы.Ламода);
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901 

//+ ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901
Функция ПолучитьНаименованиеМаркетплейса(Маркетплейс) Экспорт
	
	Результат = "";
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Результат = "WildBerries";
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Результат = "Ozon";
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Результат = "Яндекс";	
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Результат = "Сбер";		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Результат = "Aliexpress"; 
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Результат = "Ламода";
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Иначе
		Результат = "WildBerries";					
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 04.07.24 УА #66901

#КонецОбласти

#Область РаботаСНастройками

//+ ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628
Функция ПолучитьНастройки(Профиль, МассивПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль!");
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Наименование КАК Наименование,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.ЛичныйКабинет = &Профиль
	|	И ИС_MP_Настройки.Наименование В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("МассивПараметров", МассивПараметров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Наименование, Выборка.Значение);		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;	
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628  

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
Функция ПолучитьХранилище(Профиль, МассивПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Наименование КАК Наименование,
	|	ИС_MP_Настройки.Хранилище КАК Хранилище
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.ЛичныйКабинет = &ЛичныйКабинет
	|	И ИС_MP_Настройки.Наименование В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("ЛичныйКабинет", Профиль);
	Запрос.УстановитьПараметр("МассивПараметров", МассивПараметров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Наименование, Выборка.Хранилище.Получить());		
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;	
		
КонецФункции //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
Процедура ЗаписатьХранилищеСправочника(Профиль, Параметры) Экспорт

	Событие = "ЗаписатьХранилищеСправочника";

	МассивНаименований = Новый Массив;
	
	Для Каждого Элемент Из Параметры Цикл
		МассивНаименований.Добавить(Элемент.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_MP_Настройки.Ссылка КАК Ссылка,
		|	ИС_MP_Настройки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
		|ГДЕ
		|	ИС_MP_Настройки.ЛичныйКабинет = &ЛичныйКабинет
		|	И ИС_MP_Настройки.Наименование В(&Наименование)";
	
	Запрос.УстановитьПараметр("ЛичныйКабинет", Профиль);
	Запрос.УстановитьПараметр("Наименование", МассивНаименований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ОбъектЗаписи = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.Хранилище = Новый ХранилищеЗначения(Параметры[Выборка.Наименование]);
		Параметры.Удалить(Выборка.Наименование);
		
		Попытка
			ОбъектЗаписи.Записать();
		Исключение
		  
			Текст = "Не удалось записать элемент справочника Настройки WildBerries!";
		    ЗаписьЖурналаРегистрации("ИС.WB." + Событие, УровеньЖурналаРегистрации.Ошибка, Справочники.ИС_MP_Настройки, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		    ОбщегоНазначения.СообщитьПользователю(Текст + " по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	    
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого Элемент Из Параметры Цикл
	
		ОбъектЗаписи = Справочники.ИС_MP_Настройки.СоздатьЭлемент();		
		ОбъектЗаписи.ЛичныйКабинет = Профиль;
		ОбъектЗаписи.Наименование = Элемент.Ключ;
		ОбъектЗаписи.Хранилище = Новый ХранилищеЗначения(Элемент.Значение);
	
		Попытка
			ОбъектЗаписи.Записать();
		Исключение
	  
	    	Текст = "Не удалось записать элемент справочника Настройки WildBerries!";
		    ЗаписьЖурналаРегистрации("ИС.WB." + Событие, УровеньЖурналаРегистрации.Ошибка, Справочники.ИС_MP_Настройки, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		    ОбщегоНазначения.СообщитьПользователю(Текст + " по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628
Процедура ЗаписатьНастройкиСправочника(ЛичныйКабинет, Параметры) Экспорт	
    
    Событие = ПолучитьИмяСобытия("ЗаписатьНастройкиСправочника");
    
	МассивНаименований = Новый Массив;
	
	Для Каждого Элемент Из Параметры Цикл
		МассивНаименований.Добавить(Элемент.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_MP_Настройки.Ссылка КАК Ссылка,
		|	ИС_MP_Настройки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
		|ГДЕ
		|	ИС_MP_Настройки.ЛичныйКабинет = &ЛичныйКабинет
		|	И ИС_MP_Настройки.Наименование В(&Наименование)";
	
	Запрос.УстановитьПараметр("ЛичныйКабинет", ЛичныйКабинет);
	Запрос.УстановитьПараметр("Наименование", МассивНаименований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл
	
		ОбъектЗаписи = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.Значение = Параметры[Выборка.Наименование];
		Параметры.Удалить(Выборка.Наименование);
		
		Попытка
			ОбъектЗаписи.Записать();
		Исключение    
		    ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		    
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого Элемент Из Параметры Цикл
	
		ОбъектЗаписи = Справочники.ИС_MP_Настройки.СоздатьЭлемент();		
		ОбъектЗаписи.ЛичныйКабинет = ЛичныйКабинет;
		ОбъектЗаписи.Наименование = Элемент.Ключ;
		ОбъектЗаписи.Значение = Элемент.Значение;
	
		Попытка
			ОбъектЗаписи.Записать();
		Исключение
			ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 21.02.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 02.04.24 УА #71892
Функция ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Параметр КАК Параметр,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Профиль = &Профиль
	|	И ИС_MP_Настройки.Маркетплейс = &Маркетплейс
	|	И ИС_MP_Настройки.Параметр В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("Маркетплейс", Маркетплейс);
	Запрос.УстановитьПараметр("МассивПараметров", МассивПараметров);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();

	Результат = Новый Структура;

	Пока ВыборкаПараметров.Следующий() Цикл
    	Результат.Вставить(ВыборкаПараметров.Параметр, ВыборкаПараметров.Значение);	
	КонецЦикла;
		
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 02.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 02.04.24 УА #71892
Функция ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров) Экспорт

	Событие = ПолучитьИмяСобытия("ЗаписатьЗначениеНастроек");
    
	МассивНаименований = Новый Массив;
	
	Для Каждого Элемент Из МассивПараметров Цикл
		МассивНаименований.Добавить(Элемент.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Параметр КАК Параметр,
	|	ИС_MP_Настройки.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.Профиль = &Профиль
	|	И ИС_MP_Настройки.Маркетплейс = &Маркетплейс
	|	И ИС_MP_Настройки.Параметр В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("Маркетплейс", Маркетплейс);
	Запрос.УстановитьПараметр("МассивПараметров", МассивНаименований);
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();

	Результат = Новый Структура;

	Пока ВыборкаПараметров.Следующий() Цикл

		МенеджерЗаписи = РегистрыСведений.ИС_MP_Настройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Профиль = Профиль;
		МенеджерЗаписи.Маркетплейс = Маркетплейс;
		МенеджерЗаписи.Параметр = ВыборкаПараметров.Параметр;
		МенеджерЗаписи.Значение = МассивПараметров[ВыборкаПараметров.Параметр];
		
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение    
		    ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		    
		КонецПопытки;

		МассивПараметров.Удалить(ВыборкаПараметров.Параметр);
	
	КонецЦикла;	
	
	Для Каждого Элемент Из МассивПараметров Цикл
	
		МенеджерЗаписи = РегистрыСведений.ИС_MP_Настройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Профиль = Профиль;
		МенеджерЗаписи.Маркетплейс = Маркетплейс;
		МенеджерЗаписи.Параметр = Элемент.Ключ;
		МенеджерЗаписи.Значение = Элемент.Значение;
		
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение    
		    ЗаписатьВЖРИСообщитьПользователю(Событие, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		    
		КонецПопытки;
	
	КонецЦикла;

КонецФункции //- ИнфоСофт Ивонин К.А. 02.04.24 УА #71892

//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
Функция ПолучитьПрефиксНастроек(Маркетплейс) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат "Ozon";
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат "ЯМ";
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат "Сбер";
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат "Али";
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Возврат "Ламода";
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Иначе	
		Возврат "";
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Власова И.С. 02.08.24 УА #80469

#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 12.02.23 УА #53535
Функция ПолучитьИмяМодуляКонфигурации() Экспорт
	Возврат "ИС_WB_СерверУТ11_5";
КонецФункции //- ИнфоСофт Ивонин К.А. 12.02.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628
Функция ПолучитьЗначенияСтатусовЗаказа() Экспорт 
	
	РасширенныеВозможностиЗаказа = Константы.ИспользоватьРасширенныеВозможностиЗаказаКлиента.Получить();
	ИспользоватьПострочнуюОтгрузку = Константы.ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента.Получить(); 
	
	Статусы = Новый Структура;
	
	Если РасширенныеВозможностиЗаказа И ИспользоватьПострочнуюОтгрузку Тогда
	               
		Статусы.Вставить("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);	
		Статусы.Вставить("СтатусСтроки", Перечисления.ВариантыОбеспечения.Отгрузить);
		
	ИначеЕсли РасширенныеВозможностиЗаказа И Не ИспользоватьПострочнуюОтгрузку Тогда
	
		Статусы.Вставить("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);	
		Статусы.Вставить("СтатусСтроки", Перечисления.ВариантыОбеспечения.Отгрузить);
		
	Иначе             
	
		Статусы.Вставить("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);	
		Статусы.Вставить("СтатусСтроки", Перечисления.ВариантыОбеспечения.НеТребуется)
		
	КонецЕсли;
	
	Возврат Статусы;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 20.03.2023 УА #54628

//+ ИнфоСофт Ивонин К.А. 20.02.23 УА #53535
Функция ПолучитьПрименениеНДСОрганизации(Организация) Экспорт
		
	ОрганизацияПрименяетУСН = ОрганизацияПрименяетУСН(Организация);
		
	Если ОрганизацияПрименяетУСН <> Неопределено И ОрганизацияПрименяетУСН Тогда
		Возврат Ложь;	
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.ПрименяетсяОсвобождениеОтУплатыНДС КАК ПрименяетсяОсвобождениеОтУплатыНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Не Выборка.ПрименяетсяОсвобождениеОтУплатыНДС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции //- ИнфоСофт Ивонин К.А. 20.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.08.23 УА #61542
Процедура ЗаписатьДанныеОтладки(Профиль, Маркетплейс, Метод, ПараметрыЗапроса, РезультатЗапроса) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ИС_МП_ДанныеОтладки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;

	ПортПоУмолчанию = ?(ПараметрыЗапроса.ЗащищенноеСоединение, ":443", ":80");
	
	Запрос = ?(ПараметрыЗапроса.ЗащищенноеСоединение, "https://", "http://") 
		+ ПараметрыЗапроса.Сервер 
		+ ?(ПараметрыЗапроса.Порт = 0, ПортПоУмолчанию, ":" + ПараметрыЗапроса.Порт)
		+ ПараметрыЗапроса.АдресРесурса;

	МенеджерЗаписи.Запрос = Запрос;
	МенеджерЗаписи.Метод = Метод;
	МенеджерЗаписи.ЗаголовкиЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(ПараметрыЗапроса.Заголовки); 

	Если ПараметрыЗапроса.ИмяФайлаТела <> Неопределено 
		И ТипЗнч(ПараметрыЗапроса.ИмяФайлаТела) = Тип("Строка")  Тогда

		ТелоЗапроса = СтрШаблон("Файл: %1", ПараметрыЗапроса.ИмяФайлаТела);	

	ИначеЕсли ПараметрыЗапроса.ТелоДвоичныеДанные <> Неопределено 
		И ТипЗнч(ПараметрыЗапроса.ТелоДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		
		ТелоЗапроса = "ДвоичныеДанные";
		
	ИначеЕсли ПараметрыЗапроса.ТелоСтрока <> Неопределено 
		И ТипЗнч(ПараметрыЗапроса.ТелоСтрока) = Тип("Строка") Тогда
		
		ТелоЗапроса = ПараметрыЗапроса.ТелоСтрока;
	
	Иначе
		ТелоЗапроса = "Тело запроса отсутствует";
	КонецЕсли;  
		
	МенеджерЗаписи.ТелоЗапроса = ТелоЗапроса;
	МенеджерЗаписи.КодОтвета = РезультатЗапроса.КодОтвета;
		
	Если РезультатЗапроса.ЕстьОшибки Тогда	 
		МенеджерЗаписи.ТелоОтвета = ПодробноеПредставлениеОшибки(РезультатЗапроса.ИнформацияОбОшибке);
	Иначе    
	
		МенеджерЗаписи.ЗаголовкиОтвета = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтрокуJSON(РезультатЗапроса.Заголовки); 
		МенеджерЗаписи.ТелоОтвета = РезультатЗапроса.Ответ;
	
	КонецЕсли;	

	МенеджерЗаписи.Записать();	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.08.23 УА #61542

//+ ИнфоСофт Ивонин К.А. 10.11.23 УА #55166
Функция ПолучитьВерсиюОбработкиРеглЗаданий() Экспорт
	Возврат "0.4";
КонецФункции //- ИнфоСофт Ивонин К.А. 10.11.23 УА #55166

//+ ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986
Процедура ПолучитьОстаткиFBO(Профиль) Экспорт
	
	//+ ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504
	//+ ИнфоСофт Стояк Ю.К. 20.03.2025 УА #96638
	НастройкиOzon = Новый Массив;
	НастройкиЯМ = Новый Массив;
	
	Если Профиль.ИнтеграцияОзон Тогда
		НастройкиOzon = ИС_Ozon_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
	КонецЕсли;
	
	Если Профиль.ИнтеграцияЯМ Тогда
		НастройкиЯМ = ИС_ЯМ_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
	КонецЕсли;                                      
	//НастройкиOzon = ИС_Ozon_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
	//НастройкиЯМ = ИС_ЯМ_СерверПовтИсп.ПолучитьНастройкиСоединения(Профиль);
	//- ИнфоСофт Стояк Ю.К. 20.03.2025 УА #96638	
	
	Попытка
		
		ОстаткиFBOWB = ИС_WB_Сервер.ПолучитьИнфорамциюОбОстаткахFBO(Профиль);  
		
		Если ЗначениеЗаполнено(ОстаткиFBOWB) Тогда				
			ЗаписатьОстатокFBO(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, ОстаткиFBOWB);
		КонецЕсли;
		
	Исключение
		// Не подключен ВБ	
	КонецПопытки;
	
	    //+ ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504
	Если НастройкиOzon.Количество() > 0 Тогда
		//- ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504
		//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		//ОстаткиOzon = ИС_Ozon_Сервер.ПолучитьИнформациюОбОстатках(Профиль);
		ОстаткиOzonПоСкладам = ИС_Ozon_Сервер.ПолучитьИнформациюПоОтчётПоОстаткамИТоварам(Профиль); 
		//- ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		
		//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		//Если ЗначениеЗаполнено(ОстаткиOzon)Тогда		
		//	ЗаписатьОстатокFBO(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, ОстаткиOzon.FBO);
		//КонецЕсли; 	
		Если ЗначениеЗаполнено(ОстаткиOzonПоСкладам)Тогда
			ЗаписатьОстатокFBO(Профиль, Перечисления.ИС_МП_Маркетплейсы.Озон, ОстаткиOzonПоСкладам);  
		КонецЕсли;	
		//- ИнфоСофт Заварин К.В. 10.07.24 УА #70305  
		//+ ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504
	КонецЕсли;
	
	Если НастройкиЯМ.Количество() > 0 Тогда
		//- ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504
		СписокМагазинов = ИС_ЯМ_Сервер.ПолучитьСписокМагазинов(Профиль); 		 
		
		Если СписокМагазинов = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		КампанияID = Неопределено;
		
		Для Каждого Магазин Из СписокМагазинов Цикл
			Если Магазин.placementType = "FBY" Тогда
				КампанияID = Формат(Магазин.id, "ЧГ=0");	
				Прервать;
			КонецЕсли;			
		КонецЦикла; 
		
		Если КампанияID = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СкладыFBY = ИС_ЯМ_Сервер.ПолучитьСкладыFBY(Профиль); 
		
		ОстаткиЯМFBO = ИС_ЯМ_Сервер.ПолучитьОстатки(Профиль, КампанияID);		
		
		Если ЗначениеЗаполнено(ОстаткиЯМFBO) Тогда						
			ЗаписатьОстатокFBO(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, ОстаткиЯМFBO);
		КонецЕсли;
	//+ ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504	
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89504
			
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986

//+ ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253
Функция ПолучитьВидМаркированнойПродукции(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ВидНоменклатуры.ОсобенностьУчета КАК ВидМаркировки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ВидМаркировки;	
	
КонецФункции //- ИнфоСофт Сумин Д.В. 14.02.2024 УА #62253

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

#Область Профили

#КонецОбласти
                    
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ПолучитьИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_MP_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

//+ ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986 
Процедура ЗаписатьОстатокFBO(Профиль, Маркетплейс, ТаблицаОстатков) Экспорт
	
	ТаблицаОстатков = ДобавитьНоменклатуруКОстаткамFBO(Профиль, ТаблицаОстатков, Маркетплейс);
	
	Для Каждого Строка Из ТаблицаОстатков Цикл
		
		НаборЗаписейОстатоков = РегистрыСведений.ИС_MP_ОстаткиFBO.СоздатьНаборЗаписей();
		НаборЗаписейОстатоков.Отбор.Период.Установить(ТекущаяДатаСеанса());			
		НоваяЗапись = НаборЗаписейОстатоков.Добавить();	
		НоваяЗапись.Номенклатура = Строка.Номенклатура;
		НоваяЗапись.Характеристика = Строка.Характеристика;
		НоваяЗапись.Маркетплейс = Маркетплейс;
		НоваяЗапись.Профиль = Профиль;
		НоваяЗапись.Склад = Строка.Склад; 
		НоваяЗапись.Остаток = Строка.Остаток;
		НоваяЗапись.Период = ТекущаяДатаСеанса(); 
		НаборЗаписейОстатоков.Записать(Ложь);
		
	КонецЦикла; 
	
	//+ ИнфоСофт Заварин К.В. 18.07.24 УА #70305
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		НаборДляОчистки = РегистрыСведений.ИС_MP_ОстаткиFBO.СоздатьНаборЗаписей();
		НаборДляОчистки.Отбор.Склад.Установить("Нет названия");
		НаборДляОчистки.Отбор.Маркетплейс.Установить(Перечисления.ИС_МП_Маркетплейсы.Озон);
		НаборДляОчистки.Записать();
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 18.07.24 УА #70305
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986    

//+ ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986
Функция ДобавитьНоменклатуруКОстаткамFBO(Профиль, ТаблицаЗначений, Маркетплейс) 
	
	Запрос = Новый Запрос;
			
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Штрихкод КАК Barcode,
		|	Данные.ИД КАК id,
		|	Данные.НаСкладе КАК stock,
		|	Данные.Склад КАК Склад
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(Данные.stock, 0)) КАК Остаток,
		|	Данные.Склад КАК Склад,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ИС_WB_ШтрихкодыРазмеров.Штрихкод = Данные.Barcode
		|			И (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
		|			И ИС_WB_ШтрихкодыРазмеров.Размер.Владелец.Код = Данные.id
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ИС_WB_ШтрихкодыРазмеров.Размер = ИС_WB_СоответствиеРазмеров.РазмерWB
		|ГДЕ
		|	ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
		|	И НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL
		|	И Данные.Склад <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.Склад,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.nmId КАК offer_id,
		|	Данные.НаСкладе КАК stock,
		//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		|	Данные.Склад КАК Склад
		//- ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(Данные.stock, 0)) КАК Остаток,
		//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		//|	""Нет названия"" КАК Склад,
		|	Данные.Склад КАК Склад,
		//- ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика КАК Характеристика
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ПО ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id = Данные.offer_id
		|ГДЕ
		|	НЕ ИС_Ozon_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ИС_Ozon_СоответствиеХарактеристик.Характеристика,
		|	ИС_Ozon_СоответствиеХарактеристик.Номенклатура,
		//+ ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		|	Данные.Склад                            
		//- ИнфоСофт Заварин К.В. 10.07.24 УА #70305
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	ИначеЕсли Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда  
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.shopSku КАК shopSku,
		|	Данные.stock КАК stock,
		|	Данные.Склад КАК Склад
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(Данные.stock, 0)) КАК Остаток,
		|	Данные.Склад КАК Склад,
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
		|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|		ПО ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku = Данные.shopSku
		|ГДЕ
		|	НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура ЕСТЬ NULL
		|	И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.Склад,
		|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика,
		|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Данные", ТаблицаЗначений);
	Запрос.УстановитьПараметр("Профиль", Профиль);

	Результатзапроса = Запрос.Выполнить();
	
	Возврат Результатзапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 24.11.2023 УА #61986

//+ ИнфоСофт Сумин Д.В. 02.05.2024 УА #67144
Функция СоздатьКонтрагента(Организация, Настройки, Данные) Экспорт 	
	
	ИспользуютсяДоговоры 	= Константы.ИспользоватьДоговорыСКлиентами.Получить();
	ИспользуютсяСоглашения 	= Константы.ИспользоватьСоглашенияСКлиентами.Получить();
	
	//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97211
	Если СтрДлина(Данные.Инн) = 12 Тогда
		ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
		ЮрФизЛицоКонтрагент = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	Иначе
		ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
		ЮрФизЛицоКонтрагент = Перечисления.ЮрФизЛицо.ЮрЛицо;
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97211
	
	//Создание партнера
	Партнер 					= Справочники.Партнеры.СоздатьЭлемент();
	Партнер.Клиент 				= Истина;
	Партнер.Наименование       	= Данные.НаименованиеКлиента;
	Партнер.НаименованиеПолное 	= Данные.НаименованиеКлиента; 
	//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97211
	//Партнер.ЮрФизЛицо 			= Перечисления.КомпанияЧастноеЛицо.Компания;
	Партнер.ЮрФизЛицо 			= ЮрФизЛицо;
	//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97211
	Партнер.Записать();
	
	//Создание контрагента
	Контрагент 						= Справочники.Контрагенты.СоздатьЭлемент();
	Контрагент.Партнер 				= Партнер.Ссылка;
	Контрагент.Инн 					= Данные.Инн;
	Контрагент.Наименование        	= Данные.НаименованиеКлиента;
	Контрагент.НаименованиеПолное 	= Данные.НаименованиеКлиента; 
	//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97211
	//Контрагент.ЮрФизЛицо 			= Перечисления.КомпанияЧастноеЛицо.Компания;
	Контрагент.ЮрФизЛицо 			= ЮрФизЛицоКонтрагент;
	Контрагент.ЮридическоеФизическоеЛицо = ЮридическоеФизическоеЛицо;
	//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97211
	Контрагент.Записать();
	
	Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
	//Если Константы.ТолькоКомиссионныеПродажи25.Получить() Тогда
	Если Данные.КомиссионныеПродажи25 Тогда
	//- ИнфоСофт Власова И.С. 05.08.24 УА #81190
		Если Не ИспользуютсяДоговоры Тогда
			Текст = СтрШаблон("Необходимо включить использование договоров.");
			ОбщегоНазначения.СообщитьПользователю(Текст);
		Иначе
			//Создание договора реализации через комиссионера
			Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент(); 
			
			ДанныеЗаполнения = Новый Структура; 
			
			ДанныеЗаполнения.Вставить("Партнер", Партнер.Ссылка);
			ДанныеЗаполнения.Вставить("Контрагент", Контрагент.Ссылка);
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперацияПоУмолчанию", Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера);
			ДанныеЗаполнения.Вставить("ТипДоговора", Перечисления.ТипыДоговоров.РеализацияЧерезКомиссионера);
			
			Договор.Заполнить(ДанныеЗаполнения);
			Договор.Наименование 		  = "Реализация через комиссионера";
			Договор.Организация 		  = Организация;
			
			//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
			//Договор.ДоговорСКомиссионером = Настройки["ДоговорЯМ"];
			//Договор.КомиссионерПартнер 	  = Настройки["ПартнерЯМ"];
			//Договор.КомиссионерКонтрагент = Настройки["КонтрагентЯМ"];
			//Договор.Записать();
			Договор.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
			Договор.Статус               = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
			Договор.ПорядокРасчетов      = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
			
			ПрефиксНастроек = ПолучитьПрефиксНастроек(Данные.Маркетплейс);
			
			Если ПрефиксНастроек <> "" Тогда
				Договор.ДоговорСКомиссионером = Настройки["Договор"    + ПрефиксНастроек];
				Договор.КомиссионерПартнер 	  = Настройки["Партнер"    + ПрефиксНастроек];
				Договор.КомиссионерКонтрагент = Настройки["Контрагент" + ПрефиксНастроек];
			КонецЕсли;	
			//- ИнфоСофт Власова И.С. 02.08.24 УА #80469
			
			Договор.Записать();
		КонецЕсли;	
	Иначе	
		//Создание соглашения
		Если ИспользуютсяСоглашения Тогда
			
			Соглашение = Справочники.СоглашенияСКлиентами.СоздатьЭлемент();
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Организация", Организация);
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
			
			Если Константы.ИспользоватьИндивидуальныеСоглашенияСКлиентами.Получить() Тогда
				ДанныеЗаполнения.Вставить("Партнер", Партнер.Ссылка);				
			КонецЕсли;
			
			Соглашение.Заполнить(ДанныеЗаполнения);
			
			Соглашение.ИспользуютсяДоговорыКонтрагентов = ИспользуютсяДоговоры;		
			
			Соглашение.Наименование = "Соглашение реализации";
			
			Соглашение.Записать();
			
		КонецЕсли;
		
		//Создание договора
		Если ИспользуютсяДоговоры Тогда
			Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			
			//+ ИнфоСофт Власова И.С. 14.02.25 УА #93336
			//Договор.Заполнить(Партнер.Ссылка);
			
			ДанныеЗаполнения = Новый Структура; 
			
			ДанныеЗаполнения.Вставить("Партнер", 						  Партнер.Ссылка);
			ДанныеЗаполнения.Вставить("Контрагент", 					  Контрагент.Ссылка);
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперацияПоУмолчанию", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
			ДанныеЗаполнения.Вставить("ТипДоговора", 					  Перечисления.ТипыДоговоров.СПокупателем);
			
			Договор.Заполнить(ДанныеЗаполнения);
			
			Договор.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
			Договор.Статус               = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
			//- ИнфоСофт Власова И.С. 14.02.25 УА #93336
			
			Договор.Наименование = "Договор реализации";
			Договор.Организация = Организация;
			Договор.Записать();
		КонецЕсли;	
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Партнер",    Партнер.Ссылка);
	Результат.Вставить("Контрагент", Контрагент.Ссылка);
	Результат.Вставить("Договор",    Договор.Ссылка);
	Результат.Вставить("Соглашение", Соглашение.Ссылка);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 02.05.2024 УА #67144

//+ ИнфоСофт Власова И.С. 23.08.24 УА #61503
Процедура ПоказатьСообщениеОтсутствияЗаполненияНастройки(Настройка, Профиль, Маркетплейс) Экспорт
	
	НаименованиеМаркетплейса = ПолучитьНаименованиеМаркетплейса(Маркетплейс);
	
	ТекстСообщения = СтрШаблон("Не заполнено поле %1 в настройках профиля %2 для маркетплейса %3.", Настройка, Профиль, НаименованиеМаркетплейса);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.08.24 УА #61503

//+ ИнфоСофт Заварин К.В. 20.02.25 УА #73904
Процедура ЗаписатьДанныеКИЗ(Профиль, Маркетплейс, ЗаказМП = Неопределено, МассивТоваров = Неопределено) Экспорт
	
	Если МассивТоваров = Неопределено Или МассивТоваров.Количество() = 0 Или ЗаказМП = Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	Для Каждого Строка Из МассивТоваров Цикл
				
		МенеджерЗаписи = РегистрыСведений.ИС_MP_ДанныеВыгрузкиКИЗов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Профиль 	   				     = Профиль;
		МенеджерЗаписи.Маркетплейс   				 = Маркетплейс;
		МенеджерЗаписи.ЗаказМП   	  				 = ЗаказМП;
		МенеджерЗаписи.Номенклатура   				 = Строка.Номенклатура;
		МенеджерЗаписи.Характеристика    			 = Строка.Характеристика;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Профиль 	   				 	 = Профиль;
		МенеджерЗаписи.Маркетплейс   				 = Маркетплейс;
		МенеджерЗаписи.ЗаказМП   	  				 = ЗаказМП;
		МенеджерЗаписи.Номенклатура   				 = Строка.Номенклатура;
		МенеджерЗаписи.Характеристика    			 = Строка.Характеристика;
		МенеджерЗаписи.КоличествоВыгруженныхТоваров  = МенеджерЗаписи.КоличествоВыгруженныхТоваров + 1;
		
		МенеджерЗаписи.Записать(Ложь);
		
	КонецЦикла; 
		
КонецПроцедуры //- ИнфоСофт Заварин К.В. 20.02.25 УА #73904

//+ ИнфоСофт Ивонин К.А. 21.02.23 УА #53535
Функция ОрганизацияПрименяетУСН(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	//+ ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	//|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	//- ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	
	Запрос.УстановитьПараметр("Организация", Организация);
	//+ ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	//- ИнфоСофт Заварин К.В. 24.12.24 УА #90141
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Если Выборка.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.02.23 УА #53535

//+ ИнфоСофт Власова И.С. 02.08.24 УА #80469
Функция ПолучитьСтруктуруДляСозданияКонтрагента() Экспорт
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("НаименованиеКлиента");
	СтруктураДанных.Вставить("Инн");
	СтруктураДанных.Вставить("Маркетплейс");
	СтруктураДанных.Вставить("КомиссионныеПродажи25");
	
	Возврат СтруктураДанных;
	
КонецФункции //- ИнфоСофт Власова И.С. 02.08.24 УА #80469

//+ ИнфоСофт Власова И.С. 05.08.24 УА #81190
Функция ПолучитьВерсиюКомиссионныхПродаж(Профиль, Маркетплейс) Экспорт
	
	ПрефиксНастроек = ПолучитьПрефиксНастроек(Маркетплейс);
	
	НастройкаСоглашение = "Соглашение" + ПрефиксНастроек;
	НастройкаДоговор    = "Договор"    + ПрефиксНастроек;
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда	
		Настройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, СтрШаблон("%1, %2", НастройкаСоглашение, НастройкаДоговор));	
	Иначе
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	МассивНаименованийПараметров = Новый Массив;	
	МассивНаименованийПараметров.Добавить(НастройкаСоглашение);
	МассивНаименованийПараметров.Добавить(НастройкаДоговор);
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивНаименованийПараметров);	
	
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #83865
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 14.03.25 УА #83865
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"); 
	
	Если ИспользоватьСоглашенияСКлиентами И Настройки[НастройкаСоглашение] <> Неопределено И ЗначениеЗаполнено(Настройки[НастройкаСоглашение]) Тогда 
		КомиссионныеПродажи25 = Настройки[НастройкаСоглашение].КомиссионныеПродажи25;		
	ИначеЕсли Настройки[НастройкаДоговор] <> Неопределено И ЗначениеЗаполнено(Настройки[НастройкаДоговор]) Тогда
		КомиссионныеПродажи25 = Настройки[НастройкаДоговор].КомиссионныеПродажи25;
	Иначе	
		КомиссионныеПродажи25 = Неопределено;
	КонецЕсли;
	
	Если КомиссионныеПродажи25 = Неопределено Тогда
		ВызватьИсключение("Проверьте настройки заполнения профиля по схеме комиссии (Договор или соглашение).");	
	КонецЕсли;	
	
	Возврат КомиссионныеПродажи25;
	
КонецФункции //- ИнфоСофт Власова И.С. 05.08.24 УА #81190

#КонецОбласти
